#### **Imports**

In [36]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import time
import datetime

##### **Read in CSV**

In [37]:
df = pd.read_csv('CTA_-_Ridership_-_Avg._Weekday_Bus_Stop_Boardings_in_October_2012.csv')
# display first 5 rows of dataframe
df.head()

,stop_id,on_street,cross_street,routes,boardings,alightings,month_beginning,daytype,location
0,1,JACKSON,AUSTIN,126,183.4,150.0,10/01/2012,Weekday,"(41.87632184, -87.77410482)"
1,2,JACKSON,MAYFIELD (EXTENDED),126,5.3,0.2,10/01/2012,Weekday,"(41.87706679, -87.77131794)"
2,3,JACKSON,MENARD,126,8.3,0.7,10/01/2012,Weekday,"(41.87695725, -87.76975039)"
3,4,JACKSON,5700 WEST,126,17.9,3.0,10/01/2012,Weekday,"(41.87702418, -87.76745055)"
4,6,JACKSON,LOTUS,126,74.0,11.2,10/01/2012,Weekday,"(41.876513, -87.761446)"

In [38]:
df.shape

(11593, 9)

##### **Evaluate for null values**

In [39]:
df[df['routes'].isna()]

,stop_id,on_street,cross_street,routes,boardings,alightings,month_beginning,daytype,location
6642,9267,BELMONT,KEELER,NaN,62.4,35.2,10/01/2012,Weekday,"(41.93897, -87.73212)"
9211,12548,ADDISON,LAKE SHORE,NaN,2.1,185.5,10/01/2012,Weekday,"(41.94853216, -87.64355208)"

In [40]:
df[df['on_street'] == 'BELMONT']['routes'].value_counts()

77            150
77,151,156      9
151,156         1
Name: routes, dtype: int64

##### **replace null values**

In [41]:
df.loc[6642, 'routes'] = '77'
df.loc[9211, 'routes'] = '152'

In [42]:
# sanity check
df.isna().sum()

stop_id            0
on_street          0
cross_street       0
routes             0
boardings          0
alightings         0
month_beginning    0
daytype            0
location           0
dtype: int64

##### **drop month_beginning & daytype columns**

In [43]:
df.drop(columns=['month_beginning', 'daytype'], inplace=True)

In [44]:
from ast import literal_eval as make_tuple
df['location'] = df['location'].apply(make_tuple)

In [45]:
df.head()

,stop_id,on_street,cross_street,routes,boardings,alightings,location
0,1,JACKSON,AUSTIN,126,183.4,150.0,"(41.87632184, -87.77410482)"
1,2,JACKSON,MAYFIELD (EXTENDED),126,5.3,0.2,"(41.87706679, -87.77131794)"
2,3,JACKSON,MENARD,126,8.3,0.7,"(41.87695725, -87.76975039)"
3,4,JACKSON,5700 WEST,126,17.9,3.0,"(41.87702418, -87.76745055)"
4,6,JACKSON,LOTUS,126,74.0,11.2,"(41.876513, -87.761446)"

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11593 entries, 0 to 11592
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   stop_id       11593 non-null  int64
 1   on_street     11593 non-null  object
 2   cross_street  11593 non-null  object
 3   routes        11593 non-null  object
 4   boardings     11593 non-null  float64
 5   alightings    11593 non-null  float64
 6   location      11593 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 634.1+ KB